---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.NoPathOfTravel
enum: Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus
source: html/c87dc425-1e13-40b9-df6d-08fde112210b.htm
---
# Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.NoPathOfTravel

There is no valid path between the two points.